In [2]:
import pandas as pd
df=pd.DataFrame({"A":[1,5,10],
                "B":[2,6,11],
                "C":[3,None,12],
                "D":[4,8,None],
                "E":["Y","N","Y"],
                "F":["11/27/2017 17:00:00","11/26/2017 18:00:00","11/25/2017 20:00:00"]})

In [3]:
df

    A   B     C    D  E                    F
0   1   2   3.0  4.0  Y  11/27/2017 17:00:00
1   5   6   NaN  8.0  N  11/26/2017 18:00:00
2  10  11  12.0  NaN  Y  11/25/2017 20:00:00

In [4]:
df[df["A"]>3]

    A   B     C    D  E                    F
1   5   6   NaN  8.0  N  11/26/2017 18:00:00
2  10  11  12.0  NaN  Y  11/25/2017 20:00:00

In [7]:
from sklearn.impute import SimpleImputer
import numpy as np

In [9]:
df["A"]=df["A"].replace([5],np.nan)

In [10]:
df

      A   B     C    D  E                    F
0   1.0   2   3.0  4.0  Y  11/27/2017 17:00:00
1   NaN   6   NaN  8.0  N  11/26/2017 18:00:00
2  10.0  11  12.0  NaN  Y  11/25/2017 20:00:00